{
  "additionalTeam": [
    {
      "id": 1,
      "name": "Charles Myers",
      "role": "CHAIRMAN AND FOUNDER",
      "image": "./People/1.webp",
      "bio": "Charles Myers is Chairman and Founder of Signum Global Advisors, the leading geopolitical risk firm headquartered in New York and London with five additional offices around the world."
    },
    {
      "id": 2,
      "name": "Andrew Bishop",
      "role": "GLOBAL HEAD OF POLICY RESEARCH",
      "image": "./People/2.jpg",
      "bio": "Andrew Bishop, Senior Partner and global head of policy research at Signum Global Advisors, is an established political analyst with a 15-year track record of advising institutional investors, corporates and governments on political risks in developed, emerging, and frontier markets. Andrew is also head of Signum's Washington, D.C. office."
    },
    {
      "id": 3,
      "name": "Lew Lukens",
      "role": "SENIOR PARTNER",
      "image": "./People/3.jpg",
      "bio": "Lew Lukens, Senior Partner is head of Signum's San Francisco office. He previously served for 30 years as a US Foreign Service officer, representing the US overseas across five administrations and five continents."
    },
    {
      "id": 4,
      "name": "Elliot Miller",
      "role": "PARTNER",
      "image": "./People/4.jpg",
      "bio": "Elliot has built his career working with multinational companies, government stakeholders, and diplomatic missions. He is experienced in developing strategic partnerships, advising corporate clients, and convening dialogue between business leaders and policymakers."
    },
    {
      "id": 5,
      "name": "Thomas Fitzgerald",
      "role": "CHIEF OPERATING OFFICER",
      "image": "./People/5.jpg",
      "bio": "Thomas Fitzgerald, Partner and Chief Operating Officer, joined Signum Global Advisors in 2025. Based in the New York City office, Thomas leads all operational processes throughout the firm globally."
    },
    {
      "id": 6,
      "name": "Tom MacDonald",
      "role": "PARTNER",
      "image": "./People/6.jpg",
      "bio": "Partner at Signum Global Advisors, Tom focuses on supporting the firm's corporate clients across Europe and beyond, helping them navigate geopolitical and policy developments that shape their markets. He also contributes to Signum's global events and client engagement initiatives. Tom is based in London."
    },
    {
      "id": 7,
      "name": "Mingiyan Shalkhakov",
      "role": "PARTNER",
      "image": "./People/7.jpg",
      "bio": "Mingiyan Shalkhakov, Partner, is a member of the sales and client services team at Signum Global Advisors with a focus on EMEA institutional investors and financial services companies. Based in London, Mingiyan has over 10 years of experience working with public and private sector investment institutions."
    },
    {
      "id": 8,
      "name": "Sophie Laurence",
      "role": "ASSOCIATE",
      "image": "./People/8.jpg",
      "bio": "Sophie Laurence, Associate, started her career at Signum Global Advisors as a Summer Intern in 2023, and returned full-time after graduating from Amherst College in 2024 with a B.A. in Political Science and International Relations, with Computer Science courses including A.I. and cyberpolitics."
    },
    {
      "id": 9,
      "name": "Annette Detmer Acar",
      "role": "PARTNER",
      "image": "./People/9.jpg",
      "bio": "Annette Detmer Acar, Partner, is part of the London team, where she's based and leads business development in Europe with a specific focus on the DACH region."
    },
    {
      "id": 10,
      "name": "Stefan Griffiths",
      "role": "PARTNER",
      "image": "./People/10.jpg",
      "bio": "Stefan Griffiths, Partner, is head of EMEA markets sales and client services for Signum Global Advisors based in London. Prior to joining Signum, Stefan worked with Oxford Economics and Lloyds Banking Group in client engagement, business development and communications management."
    },
    {
      "id": 11,
      "name": "Matthew Mullman",
      "role": "SENIOR ANALYST, GLOBAL MACRO",
      "image": "./People/11.jpg",
      "bio": "Matthew Mullman, Senior Analyst for Global Macro at Signum Global Advisors, has nearly a decade of experience covering geopolitical developments across developed and emerging markets."
    },
    {
      "id": 12,
      "name": "Jordan Silberfeld",
      "role": "PARTNER | HEAD OF MENA CLIENT SERVICES",
      "image": "./People/12.jpg",
      "bio": "Partner and Head of MENA Client Services for Signum Global Advisors, Jordan helps the firm's engagement with institutional investors and other financial institutions, as well as spearheads certain strategic corporate development initiatives. Jordan is based in Dubai."
    },
    {
      "id": 13,
      "name": "Rafael Ch",
      "role": "PARTNER | SENIOR ANALYST",
      "image": "./People/13.jpg",
      "bio": "Rafael Ch is Partner and Senior Analyst for Latin America and Emerging Markets at Signum Global Advisors, based in NYC. With over a decade of experience, he advises on geoeconomics, macro-financial, and political risks for a range of clients including institutional investors, development banks, corporates, and governments. Rafael's expertise focuses on the impact of political frictions on asset pricing, especially in fixed-income, FX, and ESG investments."
    },
    {
      "id": 14,
      "name": "Nicholas FitzRoy",
      "role": "PARTNER | SENIOR EUROPE ANALYST",
      "image": "./People/14.jpg",
      "bio": "Nicholas FitzRoy, Partner and Senior Europe Analyst at Signum Global Advisory, has a decade of experience producing political and economic analysis, mainly for corporates and governments."
    },
    {
      "id": 15,
      "name": "George Pollack",
      "role": "SENIOR ANALYST, U.S. POLITICS",
      "image": "./People/15.jpg",
      "bio": "George Pollack is a Senior Analyst for U.S. Policy with Signum in Washington D.C., where he contributes to domestic policy research and helps advise clients on understanding complex legislative, regulatory, and executive developments."
    },
    {
      "id": 16,
      "name": "David Pagliaro",
      "role": "SENIOR PARTNER",
      "image": "./People/16.jpeg",
      "bio": "David Pagliaro, Senior Partner, is Signum's Global Head of Client Services. Based in London, David oversees the coordination and delivery of the firm's commercial efforts and leads the business development team globally."
    },
    {
      "id": 17,
      "name": "Regina Ewers",
      "role": "PARTNER",
      "image": "./People/17.jpg",
      "bio": "Regina Ewers, Partner, is a member of the sales and client service team for Signum Global Advisors. Regina has over 15 years experience in financial services on the buy-side and sell-side."
    },
    {
      "id": 18,
      "name": "Jason Press",
      "role": "SENIOR PARTNER",
      "image": "./People/18.png",
      "bio": "Jason Press, Senior Partner focuses on client relationships for Signum Global Advisors. With more than 20 years in global markets, he works with a wide variety of financial institutions and corporations providing insights and forecasting how political and global macro developments affect investment portfolios and business strategies."
    },
    {
      "id": 19,
      "name": "Paul LoGiudice",
      "role": "PARTNER",
      "image": "./People/19.jpg",
      "bio": "Paul LoGiudice, Partner, is a member of the sales and client services team for Signum Global Advisors. Based in Boston, Paul has over 25 years of experience in institutional equities, covering both US and International markets."
    }
  ]
}
